{
  "1.0.13": {
    "fixes": [
      "Fixes an issue with tactical map icons not being totally transparent when loaded."
    ]
  },
  "1.0.12": {
    "features": ["Add a thrusters adjustment viewscreen card."],
    "fixes": [
      "Add clock syncing between the server and the client. This will match sensors and the railgun up a bit more.",
      "Fixed the layout of the software panels."
    ]
  },
  "1.0.11": {
    "features": [
      "Add a Thrusters Lite card that removes the 3d view from the center of the screen.",
      "Added the ability to assign training recordings to individual stations. These recordings will appear when training mode is on for the simulator. The recordings can be either videos or audio and will persist between card changes."
    ],
    "fixes": ["Add icons for all of the junior cards."]
  },
  "1.0.10": {
    "features": [
      "Add a bridge map card and core for running actions on specific clients. Note that this requires a specially configured SVG to work properly. Please see https://thoriumsim.com/docs/bridge-map/ for more information."
    ],
    "fixes": [
      "Fixes an issue with inserting timeline events.",
      "If traveling at a speed, the stars viewscreen will now properly show the speed instead of ramping up from stopped every time.",
      "When configuring sensor contacts in mission configurations, the contact information will now update.",
      "Bridge officer messaging settings will now properly transfer from the template simulator.",
      "Fixes an issue where alert conditions don't reset with the flight.",
      "Fixes an issue with the initialization of reactors.",
      "Fixes an issue with saving velocities on engines."
    ]
  },
  "1.0.9": {
    "features": [
      "Added the ability to play random sounds from within a folder in the sound player macro."
    ],
    "fixes": [
      "Fixed an issue with sending action commands.",
      "Fixed an issue with adding locations to systems.",
      "Fluxing power to all systems will no longer adjust systems with no power levels."
    ]
  },
  "1.0.8": {
    "fixes": [
      "Fixed an issue with the layout of torpedo launchers on the Targeting screen.",
      "Fixed an issue where sound effects play again when the simulator changes.",
      "Fixed an issue where you can only type one character at a time when changing card names."
    ]
  },
  "1.0.7": {
    "features": [
      "Added timeline events for adding and removing interception signals.",
      "Added timeline events for adding and removing targeting target classes."
    ],
    "fixes": ["Improved how timeline event names display."]
  },
  "1.0.6": {
    "features": [
      "Added a special sound picker which allows for nested folders. This allows you to add folders to your sounds folder and pick from any sound within any of those folders.",
      "Add the ability to export keyboards and tactical maps."
    ],
    "fixes": [
      "Fix an issue with the viewscreen not properly showing up, particularly with the timer viewscreen.",
      "Fix scrolling on the sets control. Also adds sound player and keyboards to the station options when configuring a set.",
      "Fixes for issues with configuring the software panels.",
      "Fixes for the stealth field animation.",
      "Fixes for damage report configurations not being editable.",
      "Fixes an issue where the library buttons for importing, exporting, and deleting were hidden.",
      "Fixes an issue where certain actions aren't working properly.",
      "Fixes an issue where changing the mosaic layout to a saved layout isn't persisted when navigating away from the core."
    ]
  },
  "1.0.5": {
    "fixes": [
      "Fixed the rotation of the jump drive colored circles.",
      "Fixes an issue where sound effect volume levels couldn't be adjusted."
    ]
  },
  "1.0.4": {
    "features": [
      "Added an 'Auto-Complete' toggle to the sickbay config for decontamination.",
      "Added notifications for the Jump Drive."
    ],
    "fixes": [
      "You can no longer request damage reports that have already been requested.",
      "Improved the actions macro to support more destinations and actions.",
      "Deleting cards on the station config should work now.",
      "Teams must now have a name, orders, location, priority, and officers assigned before being created.",
      "Refactored relative imports to make developer's lives easeier.",
      "Fixed an error when generating damage team damage report steps.",
      "Fixed an issue with communication images not rendering when they don't appear in the 'Comm Images' folder. WARNING: This might require you to redo your comm images in the short range comm system config of your simulator config."
    ]
  },
  "1.0.3": {
    "features": [
      "Added additional German translations (Thanks aBlueShadow!)",
      "Added the Jump Drive, a supplement to regular engines."
    ],
    "fixes": [
      "Tactical map icons should start animating movement immediately and shouldn't snap to their end position so quickly.",
      "Fixed the broken Phoenix viewscreen layout.",
      "Fixed issues with the scaling of tactical maps on viewscreens.",
      "Long Range Messages now show as encrypted on the animation when sent through Long Range Messages"
    ]
  },
  "1.0.2": {
    "features": ["Add Computer Core training"],
    "fixes": ["Fixes a major issue with sensor contacts not being draggable."]
  },
  "1.0.1": {
    "features": [
      "Add notifications for when railgun projectiles hit and when they are destroyed by the railgun.",
      "Added the ability to create extra system reports for R&D and Engineering"
    ],
    "fixes": [
      "A minor fix to chaging station and station set names.",
      "Improvements to the hotkey cores.",
      "Renamed the 'Client Core' to 'Login Name Core' for more clarity. Split it's functionality into the 'Hypercard Core'.",
      "Fixed an issue with styling on the navigation keypad.",
      "Fixed an issue where phasers would send notifications when they are fired but they aren't charged.",
      "Fixed how the probes are refered to on the torpedo loading and firing screen.",
      "Stealth Field screen now shows the name of the system, so you can name it 'Cloaking Device', or whatever.",
      "The stealth field won't appear as activated on the status screen if it's always on.",
      "Fix the auto-movement on sensors.",
      "When systems are R&D or Engineering 'damaged', they don't appear in the status screen list",
      "Planets, borders, and pings won't appear as targeting contacts anymore."
    ]
  },
  "1.0.0": {
    "features": [
      "First major release! Yay! 🎉",
      "Added the ShipStation layout.",
      "Add support for dynamic message groups. In addition to Security, Damage, and Medical teams, you can set up specific preset groups on specific stations.",
      "Refactored the sensors grid to support any configuration of rings, lines, and alignment.",
      "Added the ability to change targeting/weapons range.",
      "Added the ability to insert timeline items after the currently selected timeline item."
    ],
    "fixes": [
      "Viewscreens are now filtered by whether they are connected or not.",
      "Target icon selection should now stay within the bounds of the component."
    ]
  },
  "0.4.9": {
    "features": [
      "Added this release notes page!",
      "Added the ability to tag sensor contacts as hostile.",
      "Added the battle core. Hostile sensor contacts appear in this core, and can be instructed to fire on the simulator. When they fire, small projectiles appear on the sensor grid.",
      "Added a railgun, which can be used to destroy incoming projectiles.",
      "Added a 'Overlay' button to the viewscree core. This makes the layout overlay on top of viewscreen in all cases. This currently only applies to the Line layout.",
      "Added ability to control the viewscreen with the page up and page down buttons - useful for using clickers.",
      "Added sound back to the video viewscreen, but only on the actual viewscreen."
    ],
    "fixes": [
      "Fixed an issue where the faces viewscreen didn't show any images.",
      "Fixed a minor issue with dilithium stress that caused the viewscreen to break.",
      "Fixed an issue with the ship view viewscreen component where you couldn't type in text."
    ]
  },
  "0.4.8": {
    "features": ["Added the dilithium stress status to the status card."],
    "fixes": [
      "Fixed an issue with the line layout.",
      "Added scrolling to the simulator and mission lists.",
      "Fixed an issue that could happen when making new flights.",
      "Cleaned up places where checkboxes overlay.",
      "Fixed an issue with the curve frame card switcher.",
      "Fixed the Begin Training button on the login screen."
    ]
  }
}
