{
  "alert-condition": "Alarmstufe",
  "alert-level-description-1": "Diese Alarmstufe wird genutzt, wenn sich das Schiff in Gefahr befindet oder angegriffen wird. Alle Besatzungsmitglieder befinden sich im Dienst und auf ihren Gefechtsstationen.",
  "alert-level-description-2": "Diese Alarmstufe wird genutzt, wenn sich das Schiff in einer gefährlichen Situation befindet, aber im Moment noch relativ sicher ist. Die gesamte Besatzung befindet sich im Dienst.",
  "alert-level-description-3": "Diese Alarmstufe wird genutzt, wenn das Schiff für eine Notsituation bereit sein muss. Alle Besatzungsmitglieder, die sich gerade nicht im Dienst befinden, sind in Bereitschaft.",
  "alert-level-description-4": "Diese Alarmstufe wird genutzt, wenn es auf dem Schiff ein kleineres Problem gibt. Die Besatzung befindet sich im normalen Dienst, mit Ausnahme der Schadensabwehr-Teams.",
  "alert-level-description-5": "Diese Alarmstufe wird genutzt, wenn sich das Schiff im Normalzustand befindet. Die Besatzung befindet sich im normalen Dienst und das Schiff ist nicht in Gefahr.",
  "computer-core-training-1": "Der Computerkern ist das Gehirn des Schiffs. Die Kontrollen der Computer-Knotenpunkte auf der Brücke und auf dem gesamten Schiff sind mit dem Computerkern verbunden. Auf ihm läuft ein hochentwickelten Betriebssystem, welches größtenteils selbstständig arbeitet.",
  "computer-core-training-10": "Klicke auf den 'Dateien'-Knopf. Dann wähle eine Stufe, um einige Dateien zu sehen.",
  "computer-core-training-11": "Hier sind die Dateien. Dateien haben meistens langweilige, beschreibende Namen. Beschädigte Dateien haben allerdings auch beschädigte und unverständliche Namen.  Diese Dateien können Knotenpunkte zum Absturz bringen. Glücklicherweise bewahren wir unveränderliche Sicherungen aller Dateien auf, die genutzt werden können, um beschädigte Dateien zu reparieren.",
  "computer-core-training-12": "Wähle eine Datei, um sie einzeln wiederherzustellen. Wenn es zu viele Beschädigte Dateien gibt, kannst du auch alle Dateien derselben Stufe wiederherstellen.",
  "computer-core-training-13": "Wie du siehst, gibt es hier viel zu tun - und deine Aufgabe ist sehr wichtig. Ohne einen aufmerksamen Techniker könnte es passieren, dass sich der Computerkern komplett abschaltet. Achte daher genau auf die Benutzer, scanne nach Viren, stelle Dateien wieder her, und starte Knotenpunkte neu, wenn es nötig ist, dann wird hoffentlich alles problemlos ablaufen.",
  "computer-core-training-2": "Aber wie bei jeder Technik ist auch der Computerkern nicht perfekt. Er kann von außen angegriffen werden. Hacker und Viren können sich Zugang zum System verschaffen, und Dateien beschädigen, was dafür Sorgen kann, dass sich Knotenpunkte abschalten. Deine Aufgabe ist es, die Knotenpunkte am laufen zu halten. Wenn sich zu viele Knoten abschalten, werden sich die Systeme auf dem Schiff unvorhersehbar verhalten.",
  "computer-core-training-3": "Dies ist eine Liste der Computerknoten, angezeigt mit Nummer und Status. Wenn ein Knoten offline ist, musst du ihn neu starten. Wähle dafür zuerst den Knoten aus, den du neu starten willst.",
  "computer-core-training-4": "Betätige diesen Knopf, um den Knoten neu zu starten. Das kann ein paar Sekunden dauern.",
  "computer-core-training-5": "Viren können den Computerkern infizieren und Dateien beschädigen. Viren können leicht gefunden und entfernt werden, indem du zuerst durch Druck auf diesen Knopf scannst. Wenn ein Virus gefunden wurde, klicke auf den Knopf 'Virus entfernen' um ihn zu löschen.",
  "computer-core-training-6": "Du kannst alle Benutzer mit Zugriff auf den Computerkern sehen, und alle Dateien, die dafür Sorgen, dass der Computerkern reibungslos funktioniert. Schalte mit diesen Knöpfen zwischen Benutzern und Dateien um. Betätige nun den Knopf 'Benutzer'.",
  "computer-core-training-7": "Benutzer und Dateien sind nach Zugangsstufen geordnet. Stufe 1 ist die höchste Stufe mit den meisten Zugriffsrechten und Stufe 10 die niedrigste.",
  "computer-core-training-8": "Die Benutzer erscheinen in dieser Tabelle. Du solltest regelmäßig die Benutzerliste überprüfen, und sicher gehen dass sich keine ungewöhnlichen Benutzer dort befinden. Solch ein Benutzer könnte ein Hacker sein. Hacker können Viren erstellen, mit denen Dateien beschädigt werden könnten. Wenn alle Hacker ausgesperrt sind, können keine neuen Viren mehr entstehen.",
  "computer-core-training-9": "Benutze diese Knöpfe um einen neuen Benutzer zu erstellen oder den gerade ausgewählten Benutzer zu entfernen. Wenn du einen neuen Benutzer erstellst, musst du einen Namen, ein Passwort und eine Stufe vergeben. Gib dem Benutzer nur die höchste Stufe, die nötig ist, um seine Aufgaben zu erledigen. Gib ihm nicht mehr Zugriffsrechte als notwendig.",
  "damage-report-cancel": "Abbrechen",
  "damage-report-clear": "Bericht Löschen",
  "damage-report-next": "Nächster Schritt",
  "damage-report-previous": "Vorheriger Schritt",
  "damage-report-reactivate": "Reaktivieren",
  "damage-report-report": "Schadensbericht",
  "damage-report-request": "Schadensbericht anfordern",
  "damage-report-rnd": "Verfügbare Forschungsberichte",
  "damage-report-rnd-report": "Forschungsbericht",
  "damage-report-rnd-training-1": "Während einer Mission können manchmal Forschungs- und Entwicklungsberichte fertiggestellt werden. Diese Berichte erlauben es dir, die Schiffssysteme aufzurüsten, zu verbessern und neue Systeme zu aktivieren.",
  "damage-report-rnd-training-2": "Wenn ein Forschungsbericht noch nicht erstellt wurde, muss ein solcher Bericht zunächst durch Betätigung dieses Knopfes angefordert werden.",
  "damage-report-rnd-training-3": "Wenn ein System aufgerüstet werden kann, erscheinen hier Anweisungen, wie diese Verbesserung durchgeführt werden kann. Folge ihnen so genau wie möglich.",
  "damage-report-rnd-training-4": "Manchmal benötigt ein System einen Reaktivierungscode, der eingegeben werden muss, um den Vorgang abzuschließen. Betätige den Knopf mit der Aufschrift 'Reaktivierungscode eingeben', dann gib die Symbole ein, die im Bericht angegeben sind. Sobald der Aktivierungscode angenommen wurde, ist der Furschungsbericht abgeschlossen.",
  "damage-report-systems": "Beschädigte Systeme",
  "damage-report-training-1": "Die Schiffssysteme sind intelligent genug, um zu erkennen wenn sie beschädigt wurden, und (meistens) auch wie sie wieder repariert werden können. Eine Liste der beschädigten Systeme wird hier erscheinen. Wähle dort dann ein System aus, um den Schadensbericht zu sehen.",
  "damage-report-training-2": "Wenn der Schadensbericht noch nicht erstellt wurde, muss er erst angefordert werden (Durch Betätigen des Knopfes 'Schadensbericht anfordern').",
  "damage-report-training-3": "Ist ein System beschädigt, werden hier Anweisungen erscheinen, um den Fehler zu finden und das System zu reparieren. Folge ihnen so genau wie möglich.",
  "damage-report-training-4": "Manchmal benötigt ein System einen Reaktivierungscode, der eingegeben werden muss, um die Reperatur abzuschließen. Betätige den Knopf mit der Aufschrift 'Reaktivierungscode eingeben' , dann gib die Symbole ein, die im Bericht angegeben sind. Sobald der Reaktivierungscode angenommen wurde, ist das System repariert.",
  "damage-report-verify": "Bestätige Schritt",
  "damage-report-verifying": "Schritt bestätigen",
  "flight-config": "Flug zusammenstellen",
  "major-upgrade-warning": "Dies ist ein Hauptversions-Update. Bitte sichere dein Thorium-Daten-Verzeichnis sowie die Programmdatei, bevor dieses Update ausgeführt wird.",
  "railgun-available-ammo": "Verfügbare Munition: {availableAmmo}",
  "railgun-load": "Railgun laden",
  "railgun-loaded-ammo": "Geladene Munition: {ammo}",
  "railgun-loader-training-1": "Die Railgun ist eine Verteidigungswaffe, die konstruiert wurde um heranfliegende Geschosse zu zerstören. In diesem Bildschirm kannst du die Railgun laden.",
  "railgun-loader-training-2": "Hier siehst du, wie viele Projektile geladen sind. Achte darauf, dass dir die Railgun-Projektile niemals ausgehen!",
  "railgun-loader-training-3": "Betätige diesen Knopf um ein Projektil zu laden.",
  "railgun-training-1": "Die Railgun ist eine Verteidigungswaffe, die konstruiert wurde um heranfliegende Geschosse zu zerstören. Die kannst sie nutzen, um Angriffe auf das Schiff abzuwehren.",
  "railgun-training-2": "Dieser Sensorschirm zeigt die Position aller ankommenden Projektile an. Unser Schiff befindet sich dabei in der Mitte des Schirms.",
  "railgun-training-3": "Um die Railgun abzufeuern, klicke auf den Sensor-Bereich. Ein roter Punkt zeigt an, wo das Railgun-Projektil treffen wird. Um ein ankommendes Geschoss zu treffen, muss du sehr genau zielen.",
  "railgun-training-4": "Wenn ein feindliches Geschoss zerstört wurde, ist eine kurze Explosion zu sehen, und das Geschoss verschwindet.",
  "return-to-main": "Zurück zur Übersicht",
  "rnd-report-request": "Request Report",
  "sound-player": "Sound-Player",
  "upgrade-instructions": "Das Update wird im Hintergrund heruntergeladen. Warte, bis das Kommandozeilenfenster für den Thorium-Server 'Download complete' anzeigt, bevor du den Server neu startest.",
  "upgrade-warning": "Diese Version von Thorium ist veraltet. Die neueste Version ist {newVersion}. Diese Version: {oldVersion}",
  "version-number": "Version {version}"
}
