{
  "alert-condition": "Alarmstufe",
  "alert-level-description-1": "Diese Alarmstufe wird genutzt, wenn sich das Schiff in Gefahr befindet oder angegriffen wird. Alle Besatzungsmitglieder befinden sich im Dienst und auf ihren Gefechtsstationen.",
  "alert-level-description-2": "Diese Alarmstufe wird genutzt, wenn sich das Schiff in einer gefährlichen Situation befindet, aber im Moment noch relativ sicher ist. Die gesamte Besatzung befindet sich im Dienst.",
  "alert-level-description-3": "Diese Alarmstufe wird genutzt, wenn das Schiff für eine Notsituation bereit sein muss. Alle Besatzungsmitglieder, die sich gerade nicht im Dienst befinden, sind in Bereitschaft.",
  "alert-level-description-4": "Diese Alarmstufe wird genutzt, wenn es auf dem Schiff ein kleineres Problem gibt. Die Besatzung befindet sich im normalen Dienst, mit Ausnahme der Schadensabwehr-Teams.",
  "alert-level-description-5": "Diese Alarmstufe wird genutzt, wenn sich das Schiff im Normalzustand befindet. Die Besatzung befindet sich im normalen Dienst und das Schiff ist nicht in Gefahr.",
  "damage-report-cancel": "Abbrechen",
  "damage-report-clear": "Bericht Löschen",
  "damage-report-next": "Nächster Schritt",
  "damage-report-previous": "Vorheriger Schritt",
  "damage-report-reactivate": "Reaktivieren",
  "damage-report-report": "Schadensbericht",
  "damage-report-request": "Schadensbericht anfordern",
  "damage-report-rnd": "Verfügbare Forschungsberichte",
  "damage-report-rnd-report": "Forschungsbericht",
  "damage-report-rnd-training-1": "Während einer Mission können manchmal Forschungs- und Enzwicklungsberichte fertiggestellt werden. Diese Berichte erlauben es dir, die Schiffssysteme aufzurüsten, zu verbessern und neue Systeme zu aktivieren.",
  "damage-report-rnd-training-2": "Wenn ein Forschungsbericht noch nicht erstellt wurde, muss ein solcher Bericht zunächst durch Betätigung dieses Knopfes angefordert werden.",
  "damage-report-rnd-training-3": "Wenn ein System aufgerüstet werden kann, erscheinen hier Anweisungen, wie diese Verbesserung durchgeführt werden kann. Folge ihnen so genau wie möglich.",
  "damage-report-rnd-training-4": "Manchmal benötigt ein System einen Reaktivierungscode, der eingegeben werden muss, um den Vorgang abzuschließen. Betätige den Knopf mit der Aufschrft 'Reaktivierungscode eingeben', dann gib die Symbole ein, die im Bericht angegeben sind. Sobald der Aktivierungscode angenommen wurde, ist der Furschungsbericht abgeschlossen.",
  "damage-report-systems": "Beschädigte Systeme",
  "damage-report-training-1": "Die Schiffssysteme sind intelligent geung, um zu erkennen wenn sie beschädigt wurden, und (meistens) auch wie sie wieder repariert werden können. Eine Liste der beschädigten Systeme wird hier erscheinen. Wähle ein dort dann ein System aus, um den Schadensbericht zu sehen.",
  "damage-report-training-2": "Wenn der Schadensbericht noch nicht erstellt wurde, muss er erst angefordert werden (Durch betätigen des Knopfes'Schadensbericht anfordern').",
  "damage-report-training-3": "Ist ein System beschädigt, werden hier Anweisungen erscheinen, um den Fehler zu finden und das System zu reparieren. Folge ihnen so genau wie möglich.",
  "damage-report-training-4": "Manchmal benötigt ein System einen Reaktivierungscode, der eingegeben werden muss, um die Reperatur abzuschließen. Betätige den Knopf mit der Aufschrft 'Reaktivierungscode eingeben' , dann gib die Symbole ein, die im Bericht angegeben sind. Sobald der Reaktivierungscode angenommen wurde, ist das System repariert.",
  "damage-report-verify": "Bestätige Schritt",
  "damage-report-verifying": "Schritt bestätigen",
  "flight-config": "Flug zusammenstellen",
  "major-upgrade-warning": "Dies ist ein Hauptversions-Update. Bitte sichere dein Thorium-Daten-Verzeichnis sowie die Programmdatei, bevor dieses Update ausgeführt wird.",
  "railgun-available-ammo": "Available Ammunition: {availableAmmo}",
  "railgun-load": "Railgun laden",
  "railgun-loaded-ammo": "Geladene Munition: {ammo}",
  "railgun-loader-training-1": "Die Railgun ist eine Verteidigungswaffe, die konstruiert wurde um heranfliegende Geschosse zu zerstören. In diesem Bildschirm kannst du die Railgun laden.",
  "railgun-loader-training-2": "Hier siehst du, wieviele Projektile geladen sind. Achte darauf, dass dir die Railgun-Projektile niemals ausgehen!",
  "railgun-loader-training-3": "Betätige diesen Knopf um ein Projektil zu laden.",
  "railgun-training-1": "Die Railgun ist eine Verteidigungswaffe, die konstruiert wurde um heranfliegende Geschosse zu zerstören. Die kannst sie nutzen, um Angriffe auf das Schiff abzuwehren.",
  "railgun-training-2": "Dieser Sensorschirm zeigt die Position aller ankommenden Projektile an. Unser Schiff befindet sich dabei in der Mitte des Schirms.",
  "railgun-training-3": "Um die Railgun abzufeuern, Clicke auf den Sensor-Bereich. Ein roter Punt zeigt an, wo das Railgun-Projektil treffen wird. Um ein ankommendes Geschoss zu treffen, muss du sehr genau zielen.",
  "railgun-training-4": "Wenn ein feindliches Geschoss zerstört wurde, ist eine kurze Explosion zu sehen, und das Geschoss verschwindet.",
  "return-to-main": "Zurück zur Übersicht",
  "sound-player": "Sound-Player",
  "upgrade-instructions": "Das Update wird im Hintergrund heruntergeladen. Warte, bis das Kommandozeilenfenster für den Thorium-Server 'Download complete' anzeigt, bevor du den Server neu startest.",
  "upgrade-warning": "Diese Version von Thorium ist veraltet. Die neueste Version ist {newVersion}. Diese Version: {oldVersion}",
  "version-number": "Version {version}"
}
