{
  "alert-condition": "Alarmstufe",
  "alert-level-description-1": "Diese Alarmstufe wird genutzt, wenn sich das Schiff in Gefahr befindet oder angegriffen wird. Alle Besatzungsmitglieder befinden sich im Dienst und auf ihren Gefechtsstationen.",
  "alert-level-description-2": "Diese Alarmstufe wird genutzt, wenn sich das Schiff in einer gefährlichen Situation befindet, aber im Moment noch relativ sicher ist. Die gesamte Besatzung befindet sich im Dienst.",
  "alert-level-description-3": "Diese Alarmstufe wird genutzt, wenn das Schiff für eine Notsituation bereit sein muss. Alle Besatzungsmitglieder, die sich gerade nicht im Dienst befinden, sind in Bereitschaft.",
  "alert-level-description-4": "Diese Alarmstufe wird genutzt, wenn es auf dem Schiff ein kleineres Problem gibt. Die Besatzung befindet sich im normalen Dienst, mit Ausnahme der Schadensabwehr-Teams.",
  "alert-level-description-5": "Diese Alarmstufe wird genutzt, wenn sich das Schiff im Normalzustand befindet. Die Besatzung befindet sich im normalen Dienst und das Schiff ist nicht in Gefahr.",
  "damage-report-cancel": "Cancel",
  "damage-report-clear": "Clear",
  "damage-report-next": "Next Step",
  "damage-report-previous": "Previous Step",
  "damage-report-reactivate": "Reactivate",
  "damage-report-report": "Damage Report",
  "damage-report-request": "Request Damage Report",
  "damage-report-rnd": "Available R&D Reports",
  "damage-report-rnd-report": "R&D Report",
  "damage-report-rnd-training-1": "At certain times during the mission, you may be able to complete Research and Development reports. These reports allow you to upgrade, improve, and activate ship systems.",
  "damage-report-rnd-training-2": "If a research and development report hasn't been calculated, you need to request a report by clicking on this button.",
  "damage-report-rnd-training-3": "When a system may be upgraded, instructions to perform the upgrade will appear here. Follow them exactly.",
  "damage-report-rnd-training-4": "Sometimes, a system needs a reactivation code to be entered before it can be upgraded. Click the 'Enter Reactivation Code' button, then press the symbols listed in your upgrade report. Once the reactivation code is accepted, the report will be complete.",
  "damage-report-systems": "Damaged Systems",
  "damage-report-training-1": "The ship’s systems are intelligent enough to know when they’re damaged, and to understand (mostly) how they can be fixed. A list of damaged systems appears here. Click a system to see the damage report",
  "damage-report-training-2": "If a damage report hasn't been calculated, you need to request a damage report by clicking on this button.",
  "damage-report-training-3": "When a system is damaged, instructions to troubleshoot and repair the damaged system will appear here. Follow them exactly.",
  "damage-report-training-4": "Sometimes, a system needs a reactivation code to be entered before it can be repaired. Click the 'Enter Reactivation Code' button, then press the symbols listed in your damage report. Once the reactivation code is accepted, the system will be repaired.",
  "damage-report-verify": "Verify Step",
  "damage-report-verifying": "Verifying Step",
  "flight-config": "Flug zusammenstellen",
  "major-upgrade-warning": "Dies ist ein Hauptversions-Update. Bitte sichere dein Thorium-Daten-Verzeichnis sowie die Programmdatei, bevor dieses Update ausgeführt wird.",
  "railgun-available-ammo": "Available Ammunition: {availableAmmo}",
  "railgun-load": "Load Railgun",
  "railgun-loaded-ammo": "Loaded Ammunition: {ammo}",
  "railgun-loader-training-1": "The railgun is a point-defense weapon designed to destroy incoming projectiles. This screen is where you load bolts into the railgun.",
  "railgun-loader-training-2": "Here you can see the number of bolts loaded. Make sure you don't run out of railgun bolts!",
  "railgun-loader-training-3": "Click this button to load a bolt into the railgun.",
  "railgun-training-1": "The railgun is a point-defense weapon designed to destroy incoming projectiles. You can use it to defend your ship from attackers.",
  "railgun-training-2": "This basic sensors grid shows the location of any incoming projectiles relative to this ship, shown at the center of the grid.",
  "railgun-training-3": "To fire the railgun, click with your mouse on the sensor grid. A red dot will indicate where the railgun bolt will hit. You must fire very close to an incoming projectile for the bolt to hit its target.",
  "railgun-training-4": "Once an incoming projectile has been destroyed, you will see it explode and disappear.",
  "return-to-main": "Zurück zur Übersicht",
  "rnd-report-request": "Request Report",
  "sound-player": "Sound Player",
  "upgrade-instructions": "Das Update wird im Hintergrund heruntergeladen. Warte, bis das Kommandozeilenfenster für den Thorium-Server 'Download complete' anzeigt, bevor du den Server neu startest.",
  "upgrade-warning": "Diese Version von Thorium ist veraltet. Die neueste Version ist {newVersion}. Diese Version: {oldVersion}",
  "version-number": "Version {version}"
}