{
  "alert-condition": "Condition d'Alerte",
  "alert-level-description-1": "Cet condition d'alerte est pour quand l'equipiere est en danger ou se faire attaquer. All crew members are put on duty at battle stations.",
  "alert-level-description-2": "Cet condition d'alerte est pour quand l'equipiere est in a dangerous situation, but is safe for the moment. All crew members are put on duty.",
  "alert-level-description-3": "Cet condition d'alerte est pour quand l'equipiere needs to be ready for a crisis. All off duty personnel are put on stand by status.",
  "alert-level-description-4": "Cet condition d'alerte est pour quand l'equipiere a un problème mineur. All crew except damage control is on standard duty.",
  "alert-level-description-5": "Cet condition d'alerte est pour quand Ça va bien. The crew is on standard duty and the ship is in no danger.",
  "armory-training-1": "Officers will sometimes need equipment to complete whatever tasks they have been assigned. You can use this screen to see the available equipment and assign it to members of your crew.",
  "armory-training-2": "Cet bouton will allow you to change between the officers you have assigned to specific teams, and unassigned crew members without current orders.",
  "armory-training-3": "This list shows you the officers on the team you selected above, or any unassigned officers. Officers whose names are white have not been assigned any equipment.  Those highlighted in red are carrying items.",
  "armory-training-4": "You are authorized to access equipment from the rooms listed in this area.  Click to select different rooms from a drop down list.",
  "armory-training-5": "When you select a room the equipment within will be displayed in this area.  The number in parentheses represents how many there are of that item. By clicking on an item you will transfer it to the ready area.",
  "armory-training-6": "This is the ready area.  Once you have selected all of the equipment you need to assign you can select the name of the officer from the area on the right and click “Transfer to Officer.”  If you need to return an item to a room click on the item and it will return to the room it came from.",
  "armory-training-7": "Officer items will be displayed in the Equipment field. Pressing the “Remove Inventory” button will transfer all items to the ready area.",
  "bridge-map-training-1": "This screen shows a map of the bridge. You can use it to see what each station on the bridge does. Hover your mouse over or tap on a station to see a description on the right side of the screen.",
  "cargo-training-1": "This screen allows you to move cargo between the rooms on the ship.",
  "cargo-training-2": "Use this search box to locate an item of cargo that you need from anywhere on the ship.",
  "cargo-training-3": "Use these dropdowns to select choose a deck and room that you want to transfer cargo from.",
  "cargo-training-4": "The items that are available in that part of the ship will show up here. Click on the inventory that you would like to move. The inventory will move into the ready cargo area. Click multiple times to move multiple items of the same type of cargo.",
  "cargo-training-5": "Use these dropdowns to select the part of the ship you want to move the inventory to.",
  "cargo-training-6": "Ready cargo is cargo which is being prepared to move to another place. Before transferring cargo, make sure you have put all of the cargo you want to move into the ready cargo area. You can click on items here to remove them from ready cargo.",
  "cargo-training-7": "Click this button to transfer the items in the ready cargo to the room which you have selected to move the cargo into.",
  "computer-core-training-1": "The computer core is the brains of your ship. Controls for all of the stations on the bridge and throughout the ship are managed by the computer core. It runs a sophisticated operating system which mostly takes care of itself.",
  "computer-core-training-10": "Click on the files button now. Then choose a level to look at some files.",
  "computer-core-training-11": "Here are your files. Files usually have boring, descriptive names. Corrupt files, however, have corrupted names. They'll look wrong and unintelligable. These corrupt files will shut down terminals. Fortunately, we keep an immutable backup which you can use to restore corrupt files.",
  "computer-core-training-12": "Select a file to restore the file individually. If there are too many corrupt files, you can always restore all files for a level. This will create a clean-slate state for this level of files.",
  "computer-core-training-13": "It may seem like a lot, but this responsibility is important. Without a careful steward, the computer core could shut down entirely. Keep a close eye on users, scan for viruses, restore files, and restart terminals when necessary and, hopefully, everything will run perfectly smooth.",
  "computer-core-training-2": "However, like all software, the computer core is not perfectly engineered. It is succeptible to attacks from outside forces. Hackers and viruses can gain access to the system and cause files to become corrupt, which causes terminals to shut down. Your job is to keep the terminals running properly. If too many terminals shut down, systems on the ship could behave erratically.",
  "computer-core-training-3": "This is a list of the terminals on the ship, showing the number and the status. If a terminal is ever offline, you need to restart it. First, select the terminal you want to restart.",
  "computer-core-training-4": "Click this button to restart a terminal. It can take a couple of seconds.",
  "computer-core-training-5": "Viruses infect the computer core and cause files to become corrupted. You can easily find and remove viruses by first scanning for the viruses by clicking this button. If a virus is found, click the 'Remove Virus' button to remove it.",
  "computer-core-training-6": "You can see all of the users with access to the computer core and all of the files that make the computer core run properly. Toggle between viewing users and files with these buttons. Click on the 'Users' button now.",
  "computer-core-training-7": "Both users and files are organized into access levels, where level 1 is the highest, most privliaged level and level 10 is the lowest level. Click on a level to see the users in that level.",
  "computer-core-training-8": "The users appear in this table. You should regularly peruse the user list to make sure there aren't any unusual users on the list. That user might be a hacker. Remember, hackers create viruses which can corrupt files. Remove any hackers, and new viruses won't be created.",
  "computer-core-training-9": "Use these buttons to create a new user and remove the currently selected user. When creating a new user, you must specify a username, password, and level. Only give the user the highest necessary level - they don't need more access than is required.",
  "cypher-training-1": "Cyphers are used to decode messages on paper. You can see the cypher characters on your screen and match them with the characters on your printed encoded message.",
  "cypher-training-2": "This is a list of the available cyphers. Click to choose a cypher.",
  "cypher-training-3": "Here you can see the cypher characters, and the Roman character which it represents.",
  "damage-report-cancel": "Annuler",
  "damage-report-clear": "Effacer",
  "damage-report-engineering": "Engineering Bypass",
  "damage-report-next": "Prochain",
  "damage-report-previous": "Antérieur",
  "damage-report-reactivate": "Réactiver",
  "damage-report-report": "Rapport de Dommage",
  "damage-report-request": "Demande un Rapport de Dommage",
  "damage-report-rnd": "Diponible Rapports de R&D",
  "damage-report-rnd-report": "Rapport de R&D",
  "damage-report-rnd-training-1": "Quelquefois pendant le mission, you may be able to complete Research and Development reports. These reports allow you to upgrade, improve, and activate ship systems.",
  "damage-report-rnd-training-2": "If a research and development report hasn't been calculated, you need to request a report by clicking on this button.",
  "damage-report-rnd-training-3": "When a system may be upgraded, instructions to perform the upgrade will appear here. Follow them exactly.",
  "damage-report-rnd-training-4": "Sometimes, a system needs a reactivation code to be entered before it can be upgraded. Click the 'Enter Reactivation Code' button, then press the symbols listed in your upgrade report. Once the reactivation code is accepted, the report will be complete.",
  "damage-report-systems": "Systèmes Endommagés",
  "damage-report-training-1": "The ship’s systems are intelligent enough to know when they’re damaged, and to understand (mostly) how they can be fixed. A list of damaged systems appears here. Click a system to see the damage report",
  "damage-report-training-2": "If a damage report hasn't been calculated, you need to request a damage report by clicking on this button.",
  "damage-report-training-3": "When a system is damaged, instructions to troubleshoot and repair the damaged system will appear here. Follow them exactly.",
  "damage-report-training-4": "Sometimes, a system needs a reactivation code to be entered before it can be repaired. Click the 'Enter Reactivation Code' button, then press the symbols listed in your damage report. Once the reactivation code is accepted, the system will be repaired.",
  "damage-report-verify": "Vérifier",
  "damage-report-verifying": "Vérification en Progrés...",
  "engineering-report-report": "Rapport d'Ingénierie",
  "engineering-report-request": "Request Engineering Report",
  "find-cargo": "Trouver Cargo",
  "flight-config": "Flight Config",
  "jump-drive-power-available": "Power Available: {power}",
  "jump-drive-sector-activate": "Activer",
  "jump-drive-sector-aft": "Arrière",
  "jump-drive-sector-deactivate": "Désactiver",
  "jump-drive-sector-envelope-stress": "Envelope Stress",
  "jump-drive-sector-fore": "Avant",
  "jump-drive-sector-port": "Port",
  "jump-drive-sector-power": "Sector Power Adjustment",
  "jump-drive-sector-starboard": "Triboard",
  "jump-drive-training-1": "The {systemName} is a system which creates an envelope of spacetime around your ship. This envelope serves two purposes: 1) increasing momentum by moving the space around you; 2) decreasing time dilation effects of high velocities. In short, it helps your ship to move faster than the speed of light, getting you to your destination in shorter periods of time.",
  "jump-drive-training-2": "This is where you can change the envelope size surrounding your ship. A larger envelope requires more power to maintain, but gives you room for other ships to follow you in your envelope. Make sure you have sufficient power in your system before using a higher envelope size. Click the button below to activate the {systemName}.",
  "jump-drive-training-3": "There are four emitters that create your envelope, one for each side of your ship. You must ensure that each has sufficient power to operate as you travel at high speeds. As you travel at high speeds, the emitters will become stressed with the continual warping of spacetime around your ship. If they have enough power supplied, the emitters will be able to compensate for the additional stress.",
  "jump-drive-training-4": "Here you can see the current size of your envelope, along with the current stress levels, represented with color. The circle background color shows the overall stress level, with blue meaning everything is fine and red meaning you are in danger of envelope collapse. Once activated, graphical representations of the individual emitter stress levels will appear, allowing you to keep track of which emitters are doing well and which need more power.",
  "jump-drive-training-5": "You can also see the overall stress of the emitters here. Make sure this stays low. If the envelope collapses without being deactivated first, it could be very dangerous for you and your crew.",
  "major-upgrade-warning": "This is a major upgrade. Make sure you backup your Thorium data directory and program file before performing this upgrade.",
  "mission-objectives": "Objectifs de la Mission",
  "objectives-training-1": "Pendant votre mission vous aurez objectifs qu'on necessaire pour achèvement. Objectifs ont un titre et une description.",
  "objectives-training-2": "When an objective is completed, the circle next to it will be filled. Check back often to remember your objectives so you can work toward their completion.",
  "particle-detector-training-1": "The particle detector is an extension to your external sensors. It allows you to focus your sensors at a specific place around your ship to detect different types of particles.",
  "particle-detector-training-2": "This is the list of all the types of particles you can detect. Click on one to begin detecting particles.",
  "particle-detector-training-3": "Click anywhere on the grid to detect particles. You can only detect a specific type of particle within a small area at any time, so you might have to click in several areas to see where all the particles are. Be sure to switch between the different types to detect any other particles.",
  "particle-types": "Types de Particules",
  "railgun-available-ammo": "Available Ammunition: {availableAmmo}",
  "railgun-load": "Load Railgun",
  "railgun-loaded-ammo": "Loaded Ammunition: {ammo}",
  "railgun-loader-training-1": "The railgun is a point-defense weapon designed to destroy incoming projectiles. This screen is where you load bolts into the railgun.",
  "railgun-loader-training-2": "Here you can see the number of bolts loaded. Make sure you don't run out of railgun bolts!",
  "railgun-loader-training-3": "Click this button to load a bolt into the railgun.",
  "railgun-training-1": "The railgun is a point-defense weapon designed to destroy incoming projectiles. You can use it to defend your ship from attackers.",
  "railgun-training-2": "This basic sensors grid shows the location of any incoming projectiles relative to this ship, shown at the center of the grid.",
  "railgun-training-3": "To fire the railgun, click with your mouse on the sensor grid. A red dot will indicate where the railgun bolt will hit. You must fire very close to an incoming projectile for the bolt to hit its target.",
  "railgun-training-4": "Once an incoming projectile has been destroyed, you will see it explode and disappear.",
  "ready-cargo": "Ready Cargo",
  "receive-cargo-location": "Receive Cargo",
  "return-to-main": "Return to Main",
  "rnd-report-request": "Demandez Rapport",
  "roster-training-1": "On this screen you will see a list of the officers that are on the ship. You can see their name, age, gender, position, and rank. Understanding this information will help you to know what skills are available to you and who you are responsible for as a bridge officer.",
  "roster-training-2": "Trouver les officers plus rapidement vous pouvez trier l'equipage en cliquant sur la description au dessus chaque colonne.",
  "roster-training-3": "Utilizer le prochain ou l'antérieur boutons pour voir d'autres pages.",
  "sound-player": "Sound Player",
  "tasks-completed": "Task Completed",
  "tasks-instructions": "Instruction de Tâche",
  "tasks-list": "Liste des Tâches",
  "tasks-verify-button": "Vérifier l'Achèvement de Tâche",
  "tasks-verify-in-progress": "Vérification en Progrés...",
  "thx-training-1": "Le {name} est un trés powerful device which must be charged in every sector of the ship to be used. Once all sectors have been charged, it can be activated.",
  "thx-training-2": "Clique sur et hold cet bouton to charge votre secteur de le {name}.",
  "thx-training-3": "Vous pouvez regarder le niveau de charge avec cet barre d'indication.",
  "thx-training-4": "Aprés avoir finir, clique sur le 'Lock Sector' bouton.",
  "thx-training-5": "Aprés avoir regarder que tout des secteurs ont étés remplis, cliquez sur cet bouton activater le {name}.",
  "transfer-cargo": "Transfert Cargo",
  "transfer-cargo-location": "Transfert Cargo",
  "upgrade-instructions": "Le mise à jour est télécharge en arrière-plan. Attendez depuis le Thorium Server command line window monte 'Download Complete' avant restarting Thorium Server",
  "upgrade-warning": "Votre version de Thorium est démodé. Le version actuel est {newVersion}. Votre version est {oldVersion}",
  "version-number": "Version {version}"
}
