[
  {
    "id": "damage-report-rnd-training-1",
    "defaultMessage": "At certain times during the mission, you may be able to complete Research and Development reports. These reports allow you to upgrade, improve, and activate ship systems."
  },
  {
    "id": "damage-report-rnd-training-2",
    "defaultMessage": "If a research and development report hasn't been calculated, you need to request a report by clicking on this button."
  },
  {
    "id": "damage-report-rnd-training-3",
    "defaultMessage": "When a system may be upgraded, instructions to perform the upgrade will appear here. Follow them exactly."
  },
  {
    "id": "damage-report-rnd-training-4",
    "defaultMessage": "Sometimes, a system needs a reactivation code to be entered before it can be upgraded. Click the 'Enter Reactivation Code' button, then press the symbols listed in your upgrade report. Once the reactivation code is accepted, the report will be complete."
  },
  {
    "id": "damage-report-training-1",
    "defaultMessage": "The ship’s systems are intelligent enough to know when they’re damaged, and to understand (mostly) how they can be fixed. A list of damaged systems appears here. Click a system to see the damage report"
  },
  {
    "id": "damage-report-training-2",
    "defaultMessage": "If a damage report hasn't been calculated, you need to request a damage report by clicking on this button."
  },
  {
    "id": "damage-report-training-3",
    "defaultMessage": "When a system is damaged, instructions to troubleshoot and repair the damaged system will appear here. Follow them exactly."
  },
  {
    "id": "damage-report-training-4",
    "defaultMessage": "Sometimes, a system needs a reactivation code to be entered before it can be repaired. Click the 'Enter Reactivation Code' button, then press the symbols listed in your damage report. Once the reactivation code is accepted, the system will be repaired."
  },
  {
    "id": "damage-report-rnd",
    "description": "Below this header is a list of available research and development reports",
    "defaultMessage": "Available R&D Reports"
  },
  {
    "id": "damage-report-systems",
    "description": "Below this header is a list of damaged system repair reports",
    "defaultMessage": "Damaged Systems"
  },
  {
    "id": "damage-report-cancel",
    "description": "A button to stop entering a reactivation code",
    "defaultMessage": "Cancel"
  },
  {
    "id": "damage-report-clear",
    "description": "A button to clear the reactivation code input",
    "defaultMessage": "Clear"
  },
  {
    "id": "damage-report-reactivate",
    "description": "A button to confirm the entered reactivation code and begin the reactivation process",
    "defaultMessage": "Reactivate"
  },
  {
    "id": "damage-report-request",
    "description": "A button to request a repair report for a damaged system",
    "defaultMessage": "Request Damage Report"
  },
  {
    "id": "damage-report-rnd-report",
    "description": "A header for the research & development report readout",
    "defaultMessage": "R&D Report"
  },
  {
    "id": "damage-report-report",
    "description": "A header for the damage report readout",
    "defaultMessage": "Damage Report"
  },
  {
    "id": "damage-report-previous",
    "description": "A button to go to the previous step",
    "defaultMessage": "Previous Step"
  },
  {
    "id": "damage-report-verifying",
    "description": "A message indicating that the damage report step is currently being verified",
    "defaultMessage": "Verifying Step"
  },
  {
    "id": "damage-report-verify",
    "description": "A button to initiate verification of the damage report step to ensure it was completed correctly",
    "defaultMessage": "Verify Step"
  },
  {
    "id": "damage-report-next",
    "description": "A button to go to the next step",
    "defaultMessage": "Next Step"
  }
]